'''Напишіть програму, яка читає рядок з послідовністю символів-розділювачів,
наприклад, ( ) { [ ] ( ) ( ) { } } }, і надає відповідне повідомлення,
коли розділювачі симетричні, несиметричні, наприклад ( ( ( ) , або
коли розділювачі різних видів стоять у парі, як-от ( }.'''

stack = []
data = input('Введіть рядок послідовністю символів-розділювачів: ')
res = 'Симетрично'
pair = {')': '(', ']': '[', '}': '{'}

for symbol in data:
    if symbol in '([{':
        stack.append(symbol)
    elif symbol in ')]}':
        # перевірка на пустий стек, якщо пустий, починається з закритої дужки (Несиметрично)
        if not stack:
            res = 'Несиметрично'
            break
        # перевірка чи закрита відкрита (вехня) дужка, якщо відкрита закривається не тою дужкою
        # це вже не симетрично, тому ми порівнюємо пари
        if stack.pop() != pair[symbol]:
            res = 'Несиметрично'
            break

if stack: # якщо стек не пустий після циклу, є незакриті дужки
    res = 'Несиметрично'

print(f'{data}: {res}')
